#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
module.nat_gateway.aws_eip.nat_gw_eip_1: Refreshing state... [id=eipalloc-0a0e159aeaff0e8af]
module.nat_gateway.aws_eip.nat_gw_eip_0: Refreshing state... [id=eipalloc-05bef044215beeefb]
module.iam.aws_iam_policy.flow_logs_cloudwatch_policy: Refreshing state... [id=arn:aws:iam::798376091767:policy/flowlogpolicy]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0540413a145951fa9]
module.iam.aws_iam_role.flow_logs_cloudwatch_role: Refreshing state... [id=flowlogassume]
module.kms.aws_kms_key.cloudwatch_key: Refreshing state... [id=166930f2-b14a-44a3-8f9f-d85d898684dd]
module.iam.aws_iam_role_policy_attachment.flow_logs_assume: Refreshing state... [id=flowlogassume-20220114073658441700000001]
module.elb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:798376091767:targetgroup/usedelbtg000/8f299cab80e62618]
module.security_group.aws_security_group.ec2: Refreshing state... [id=sg-0de1c8ea9b8d3883f]
module.subnet.aws_subnet.public_1: Refreshing state... [id=subnet-0931f8a28fada5d47]
module.subnet.aws_subnet.public_0: Refreshing state... [id=subnet-0a2ae4b6226a7350c]
module.subnet.aws_subnet.private_0: Refreshing state... [id=subnet-0fa37042761323ce6]
module.internet_gateway.aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-03d52e9f18c3219f6]
module.security_group.aws_security_group.elb: Refreshing state... [id=sg-0851d82a2b0483a4d]
module.subnet.aws_subnet.private_2: Refreshing state... [id=subnet-017e908b681cfc0bd]
module.subnet.aws_subnet.public_2: Refreshing state... [id=subnet-0337f28a7a5281e95]
module.subnet.aws_subnet.private_1: Refreshing state... [id=subnet-0b5142f6467e13def]
module.route_table.aws_route_table.internet_gateway_rt_0: Refreshing state... [id=rtb-0f62a4704dc2c48a6]
module.nat_gateway.aws_nat_gateway.nat_gw_1: Refreshing state... [id=nat-02436f89c8e873acf]
module.launch_configuration.aws_launch_configuration.launch_configuration: Refreshing state... [id=usedlcasg000]
module.nat_gateway.aws_nat_gateway.nat_gw_0: Refreshing state... [id=nat-0f501dd914c31b071]
module.security_group.aws_security_group_rule.ec2-https-egress: Refreshing state... [id=sgrule-1990546136]
module.elb.aws_lb.web_elb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:798376091767:loadbalancer/app/usedelb000/bc83221b9059576a]
module.route_table.aws_route_table_association.internet_gateway_rta_2: Refreshing state... [id=rtbassoc-02b74cd2f879cc2df]
module.route_table.aws_route_table_association.internet_gateway_rta_0: Refreshing state... [id=rtbassoc-07118faeb5f2b551a]
module.route_table.aws_route_table_association.internet_gateway_rta_1: Refreshing state... [id=rtbassoc-09f09158ba3061fe7]
module.route_table.aws_route_table.nat_gateway_rt_1: Refreshing state... [id=rtb-00ec642b94b106fc9]
module.route_table.aws_route_table.nat_gateway_rt_0: Refreshing state... [id=rtb-0c1306ea770871152]
module.auto_scaling.aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=usedasg000]
module.route_table.aws_route_table_association.nat-gateway-pub-2: Refreshing state... [id=rtbassoc-0e8311d169e3f8975]
module.route_table.aws_route_table_association.nat-gateway-pub-1: Refreshing state... [id=rtbassoc-0f88f18ec54786a17]
module.route_table.aws_route_table_association.nat-gateway-pub-0: Refreshing state... [id=rtbassoc-00b22af7b8088b49d]
module.auto_scaling.aws_autoscaling_policy.auto_scaling_policy: Refreshing state... [id=usedasg000]
module.elb.aws_lb_listener.elb-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:798376091767:listener/app/usedelb000/bc83221b9059576a/78ba134d43defb8c]
module.cloudwatch.aws_cloudwatch_metric_alarm.auto_scaling_alarm: Refreshing state... [id=usedcwa000]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.auto_scaling.aws_autoscaling_group.auto_scaling_group has changed
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
      + enabled_metrics           = []
        id                        = "usedasg000"
      + load_balancers            = []
        name                      = "usedasg000"
      + suspended_processes       = []
        # (20 unchanged attributes hidden)
    }

  # module.cloudwatch.aws_cloudwatch_metric_alarm.auto_scaling_alarm has changed
  ~ resource "aws_cloudwatch_metric_alarm" "auto_scaling_alarm" {
        id                        = "usedcwa000"
      + insufficient_data_actions = []
      + ok_actions                = []
      + tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # module.elb.aws_lb_listener.elb-listener has changed
  ~ resource "aws_lb_listener" "elb-listener" {
        id                = "arn:aws:elasticloadbalancing:us-west-2:798376091767:listener/app/usedelb000/bc83221b9059576a/78ba134d43defb8c"
      + tags              = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.iam.aws_iam_policy.flow_logs_cloudwatch_policy has changed
  ~ resource "aws_iam_policy" "flow_logs_cloudwatch_policy" {
        id        = "arn:aws:iam::798376091767:policy/flowlogpolicy"
        name      = "flowlogpolicy"
      + tags      = {}
        # (5 unchanged attributes hidden)
    }

  # module.iam.aws_iam_role.flow_logs_cloudwatch_role has changed
  ~ resource "aws_iam_role" "flow_logs_cloudwatch_role" {
        id                    = "flowlogassume"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::798376091767:policy/flowlogpolicy",
        ]
        name                  = "flowlogassume"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.launch_configuration.aws_launch_configuration.launch_configuration has changed
  ~ resource "aws_launch_configuration" "launch_configuration" {
        id                               = "usedlcasg000"
        name                             = "usedlcasg000"
      + vpc_classic_link_security_groups = []
        # (9 unchanged attributes hidden)
    }

  # module.nat_gateway.aws_eip.nat_gw_eip_0 has changed
  ~ resource "aws_eip" "nat_gw_eip_0" {
      + association_id       = "eipassoc-010aff916e278dcc5"
        id                   = "eipalloc-05bef044215beeefb"
      + network_interface    = "eni-0f69441bcb80a0f6f"
      + private_dns          = "ip-10-0-84-237.us-west-2.compute.internal"
      + private_ip           = "10.0.84.237"
      + tags                 = {}
        # (8 unchanged attributes hidden)
    }

  # module.nat_gateway.aws_eip.nat_gw_eip_1 has changed
  ~ resource "aws_eip" "nat_gw_eip_1" {
      + association_id       = "eipassoc-0ad8d07c70715adc2"
        id                   = "eipalloc-0a0e159aeaff0e8af"
      + network_interface    = "eni-0ba81d8175b5dcf77"
      + private_dns          = "ip-10-0-87-63.us-west-2.compute.internal"
      + private_ip           = "10.0.87.63"
      + tags                 = {}
        # (8 unchanged attributes hidden)
    }

  # module.route_table.aws_route_table.internet_gateway_rt_0 has changed
  ~ resource "aws_route_table" "internet_gateway_rt_0" {
        id               = "rtb-0f62a4704dc2c48a6"
      + tags             = {}
        # (6 unchanged attributes hidden)
    }

  # module.route_table.aws_route_table.nat_gateway_rt_0 has changed
  ~ resource "aws_route_table" "nat_gateway_rt_0" {
        id               = "rtb-0c1306ea770871152"
      + tags             = {}
        # (6 unchanged attributes hidden)
    }

  # module.route_table.aws_route_table.nat_gateway_rt_1 has changed
  ~ resource "aws_route_table" "nat_gateway_rt_1" {
        id               = "rtb-00ec642b94b106fc9"
      + tags             = {}
        # (6 unchanged attributes hidden)
    }

  # module.security_group.aws_security_group.ec2 has changed
  ~ resource "aws_security_group" "ec2" {
        id                     = "sg-0de1c8ea9b8d3883f"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
            # (1 unchanged element hidden)
        ]
        name                   = "usedsgprv001"
        tags                   = {
            "contact"     = "oliverjamesfletcher@protonmail.com"
            "department"  = "engineering"
            "environment" = "development"
            "name"        = "usedsgprv001"
        }
        # (7 unchanged attributes hidden)
    }

  # module.security_group.aws_security_group_rule.ec2-https-egress has changed
  ~ resource "aws_security_group_rule" "ec2-https-egress" {
        id                = "sgrule-1990546136"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloudwatch.aws_cloudwatch_log_group.vpc_flow_logs will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:us-west-2:798376091767:key/166930f2-b14a-44a3-8f9f-d85d898684dd"
      + name              = "clwdvpcfl001"
      + retention_in_days = 365
      + tags              = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "clwdvpcfl001"
        }
      + tags_all          = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "clwdvpcfl001"
        }
    }

  # module.flow_log.aws_flow_log.main will be created
  + resource "aws_flow_log" "main" {
      + arn                      = (known after apply)
      + iam_role_arn             = "arn:aws:iam::798376091767:role/flowlogassume"
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "vpcfld001"
        }
      + tags_all                 = {
          + "contact"     = "oliverjamesfletcher@protonmail.com"
          + "department"  = "engineering"
          + "environment" = "development"
          + "name"        = "vpcfld001"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-0540413a145951fa9"
    }

  # module.security_group.aws_security_group.ec2 will be updated in-place
  ~ resource "aws_security_group" "ec2" {
        id                     = "sg-0de1c8ea9b8d3883f"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
            # (1 unchanged element hidden)
        ]
        name                   = "usedsgprv001"
        tags                   = {
            "contact"     = "oliverjamesfletcher@protonmail.com"
            "department"  = "engineering"
            "environment" = "development"
            "name"        = "usedsgprv001"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + cloudwatch_log_group_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```
</details>
*Pusher: @oliverjfletcher, Action: `pull_request`*